{"@context":"https://schema.org","@type":"FAQPage","mainEntity":[{"@type":"Question","name":"Who can invest?","acceptedAnswer":{"@type":"Answer","text":"Investors qualify to join Moonfare if they meet certain criteria based on local regulations — which may include a minimum financial instrument portfolio and sufficient prior investment experience. Due to the nature of funds we offer, Moonfare investments are available exclusively for: (i) Professional And Semi-Professional Investors Pursuant To Section 1 Para. 19 No. 32 and 33 KAGB (Germany); (ii) Professional Investors pursuant to the Securities and Futures Ordinance (Cap. 571) and the Securities and Futures (Professional Investor) Rules (Hong Kong); (iii) Professional Investors within the meaning of Annex II to Directive 2014/65/EU (EU); (iv) Certified High Net Worth Investors And Self-Certified Sophisticated Investors pursuant to COBS 4.12.6 R and COBS 4.12.8 R (UK); (v) Qualified Investors Pursuant To Art. 10 Para. 3 CISA And Art. 6 CISO (Switzerland); (vi) Qualified Private Investors within the meaning of the Austrian Alternative Investment Fund Managers Act (Austria); (vii) 'Semi-professional Investors' pursuant to sec. 5(5) of the Danish Consolidated Act no. 1047 on Alternative Investment Fund Managers and Professional Investors within the meaning of Annex II to Directive 2014/65/EU (Denmark); (viii) accredited investors under Section 4A(1)(a) of the SFA) (Singapore); and (ix) Qualified Investors & Eligible Clients (Israel)."}},{"@type":"Question","name":"How does the typical Moonfare investment work?","acceptedAnswer":{"@type":"Answer","text":"Moonfare investment vehicles pool interest in individual private equity funds. Capital calls, capital distributions and fees are all paid through the Moonfare investment vehicle. We work with industry-leading partners such as Pandomus, Deloitte, Apex Service Partners and DocuSign to ensure the process is efficient and secure."}},{"@type":"Question","name":"What's the minimum commitment?","acceptedAnswer":{"@type":"Answer","text":"The minimum allocation for Moonfare feeder funds starts at €50,000 for portfolio funds (and €100,000 for feeder funds), depending on where investors are located. We leverage technology to provide lower minimums than usual, all while respecting requirements and regulations."}},{"@type":"Question","name":"When is capital drawn on my commitment","acceptedAnswer":{"@type":"Answer","text":"Capital call schedules are determined by the underlying fund managers. In general, we structure our investments with a 25 percent upfront capital call. The remaining commitment will usually be drawn over the underlying fund's investment period, typically four to five years."}},{"@type":"Question","name":"What's the selection process for the funds on Moonfare?","acceptedAnswer":{"@type":"Answer","text":"We screen the investments on our platform using in-depth due diligence and outside-in analysis. The Moonfare FiveStar Diligence Method outlines the criteria we look for — including fund managers’ track records, team and terms. While we only focus on top-quartile investments, we cannot guarantee future performance. For a more complete breakdown of our selection criteria, please get in touch."}},{"@type":"Question","name":"What is a typical fund that Moonfare offers?","acceptedAnswer":{"@type":"Answer","text":"We only work with top-tier funds, pre-selected for quality. We typically offer funds raising capital in excess of $1 billion, with strong past performance and a track record of creating value for investors. The managers we feature on the Moonfare platform marry deep industry networks with operational excellence — enabling them to source quality deals and deliver consistent value."}},{"@type":"Question","name":"What's Moonfare's typical hold period?","acceptedAnswer":{"@type":"Answer","text":"Each opportunity has its own investment horizon, but a typical private equity fund investment has a maturity of 10 years."}},{"@type":"Question","name":"How is the net asset value (NAV) associated with a fund investment determined?","acceptedAnswer":{"@type":"Answer","text":"NAVs reflect the value of an investor’s stake in a private equity fund. Fund managers report NAV to their investors quarterly and according to strict valuation guidelines. The fund managers Moonfare works with are large organisations with significant investors, like life insurance companies and pension funds; they have high standards around accuracy and controlling the valuation process. Moonfare and our investors benefit from these high standards. The NAV reported to our investors additionally includes any potential cash reserves and liabilities of the feeder vehicles."}},{"@type":"Question","name":"How are remaining capital commitments considered with respect to Net Asset Value (NAV)?","acceptedAnswer":{"@type":"Answer","text":"Buyers and sellers on the secondary market use NAV as a reference for pricing the stake involved in their transactions. The buyer assumes the obligation to meet the remaining capital commitments in full."}},{"@type":"Question","name":"What kinds of fees should I expect?","acceptedAnswer":{"@type":"Answer","text":"Moonfare’s secondary market fees are:<br><strong>•</strong> Payable only by the seller<br><strong>•</strong> Payable only if a transaction is fully consummated (i.e. success-fee based)<br><strong>•</strong> Based on the Total Exposure* of the fund commitment being sold, defined as the sum of:<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>• </strong>The net purchase price received; AND<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>• </strong>The unfunded commitment released<br>‍<br>*minimum fees apply (see below)"}},{"@type":"Question","name":"What is the fee amount?","acceptedAnswer":{"@type":"Answer","text":"Moonfare will charge the seller the higher of: <br><strong>•</strong> 3.0% of Total Exposure; OR<br><strong>• </strong>EUR 3k flat fee (minimum fee)<br><br>EXAMPLE I<br><br>Commitment: <strong>EUR 100,000</strong><br>Contributed: <strong>EUR 25,000</strong><br>NAV: <strong>EUR 20,000</strong><br>Unfunded: <strong>EUR 75,000</strong><br>Cash Price: <strong>EUR 16,000 (80% of NAV)</strong><br><br>Total Exposure = <strong>EUR 91,000</strong><br>3.0% on Total Exposure =<strong> EUR 2,730</strong><br>Minimum Fee = <strong>EUR 3,000</strong><br>‍<br>Fee Charged: <strong>EUR 3,000 for transfer</strong><br><br>EXAMPLE II<br><br>Commitment: <strong>EUR 500,000</strong><br>Contributed: <strong>EUR 125,000</strong><br>NAV: <strong>EUR 150,000</strong><br>Unfunded: <strong>EUR 375,000</strong><br>Cash Price: <strong>EUR 139,500 (93% of NAV)</strong><br><br>Total Exposure = <strong>EUR 514,500</strong><br>3.0% on Total Exposure = <strong>EUR 15,435</strong><br>Minimum Fee = <strong>EUR 3,000</strong><br><br>Fee Charged: <strong>EUR 15,435 for transfer</strong><br>"}},{"@type":"Question","name":"Is my identity made public to other buyers or sellers?","acceptedAnswer":{"@type":"Answer","text":"It's necessary to disclose the identity of either transacting party to the respective counterparty when a transaction is executed — but not during the auction process."}},{"@type":"Question","name":"Are secondary market transactions reversible or cancellable?","acceptedAnswer":{"@type":"Answer","text":"A transaction becomes legally-binding and irreversible once legal agreements have been executed by both buyer and seller. Prior to signing the agreement, either the buyer or seller can withdraw from the process."}},{"@type":"Question","name":"When can I buy or sell interests?","acceptedAnswer":{"@type":"Answer","text":"A potential buyer or seller can indicate interest to participate in the Moonfare secondary market at any time via the Moonfare platform. Moonfare will conduct a structured auction process on a semi-annual basis, usually in the spring and fall each year, to facilitate transactions between buyers and sellers."}},{"@type":"Question","name":"How are offers to buy and sell matched in the Moonfare Secondary Market Auction?","acceptedAnswer":{"@type":"Answer","text":"Moonfare matches bids that emerge through the auction to provide sellers the best price available. Higher bids from buyers are filled first. In case of any remaining supply (i.e. stakes offered by sellers for auction), Moonfare will fill orders starting with the next highest price until all supply is sold and while respecting the seller’s reserve price.<br><br> The minimum transaction size between any buyer and seller is €100,000. In case of a stalemate between different offers to buy or sell, larger orders take preference.<br><br>Stakes offered for sale in the auction can only be sold in their entirety, either to one sole buyer or to several different buyers provided that the total original stake is sold in its entirety. Moonfare reserves the right, at its sole discretion and with a view to achieve the most favourable outcome for its existing investors and funds, to assign buyers and sellers provided the general auction rules are maintained. Moonfare reserves the right to cancel or abort any auction where in its sole view that the consummation of the transaction would not be beneficial to its investors, platform and/or partners."}},{"@type":"Question","name":"When do transactions settle? When should I expect to send or receive funds?","acceptedAnswer":{"@type":"Answer","text":"Once a buyer and seller are matched, documents must be completed and funds transferred within the periods provided in the match notification. Moonfare will facilitate the execution of completed transfers once documents are approved and funding is confirmed from all participants."}},{"@type":"Question","name":"When does my order become binding in the Moonfare Secondary Market Auction?","acceptedAnswer":{"@type":"Answer","text":"Bids are binding upon the close of the auction. If you wish to change or cancel your bid, you may contact us before then."}},{"@type":"Question","name":"What are the risks of investing in a Moonfare fund?","acceptedAnswer":{"@type":"Answer","text":"Investments in alternative investment funds, and private equity investments via feeder funds in particular, are speculative and involve a high degree of risk. Investors who can't afford to lose their entire investment should not invest. Prospective investors should carefully consider the risk warnings and disclosures for the respective fund or investment vehicle set out on the platform. The value of an investment may decrease as well as increase and investors may not be able to retrieve their original investment. Past performance does not guarantee future performance. An investment in a fund or investment vehicle is not the same as a deposit with a banking institution. Please look to the respective fund documentation for details about potential risks, charges and expenses. Additionally, investors will typically receive illiquid and/or restricted membership interests that may be subject to holding period requirements and/or liquidity concerns. In the most sensible investment strategy for private equity investing, private equity should only be a part of your overall investment portfolio. The private equity portion of your portfolio may also include a balanced portfolio of different private equity funds. Investments in private equity are highly illiquid and those investors who cannot hold an investment for the long term (at least 10 years) should not invest."}},{"@type":"Question","name":"Which fees will I need to pay when investing in a Moonfare fund?","acceptedAnswer":{"@type":"Answer","text":"For a detailed overview of our fees, please see the 'Fees' section on the respective fund page."}},{"@type":"Question","name":"Will the Moonfare team give me investment advice?","acceptedAnswer":{"@type":"Answer","text":"No. For regulatory reasons, we can't advise individual clients on their specific investments. Please consult your investment advisor or consultant."}}]}